



//-------------------------------тех_завдання---------------------------------------//


// Огляд тесту з базового JavaScript та HTML________________________________________________

// Мета додатка — дозволити кінцевим користувачам швидко вводити та керувати списком пар «ім’я/значення».
// Хоча цей тест необхідно виконати без чиєїсь допомоги, можна використовувати будь-які стандартні довідкові матеріали, які зазвичай застосовуються під час програмування (наприклад, онлайн-допомогу чи книги). Заборонено використовувати сторонні бібліотеки класів або готові фрагменти коду.

//     Створіть HTML-додаток з інтерфейсом користувача, подібним до того, що показано нижче. Код додатка має бути написаний на HTML та JavaScript. Крім того, інтерфейс повинен адаптуватися залежно від розміру екрана, на якому його переглядають. Наприклад, якщо сторінку відкрито на мобільному телефоні (наприклад, iPhone), макет повинен автоматично підлаштуватися, щоб виглядати краще. Те саме стосується зміни розміру вікна браузера на комп’ютері та перегляду сторінки на планшеті.
//     Обов’язкові функції:
//     Пари «ім’я/значення» вводяться у верхнє текстове поле. Це поле використовуватиметься кінцевим користувачем для швидкого додавання пар «ім’я/значення» до списку нижче.
//     Перед додаванням пари до списку її необхідно валідувати, щоб переконатися у правильності синтаксису. Якщо синтаксис неправильний — пару не можна додавати.
//     Формат введення пари «ім’я/значення» такий:
//     text<ім’я>=<значення>
//     де <ім’я> — частина з назвою, а <значення> — частина зі значенням.
//     До списку можна додавати тільки валідні пари «ім’я/значення». Імена та значення можуть містити лише буквено-цифрові символи (A-Z, a-z, 0-9). Знак рівності (=) використовується як роздільник пари. Пробіли перед та/або після знака рівності, введені користувачем, мають ігноруватися.
//     Коли натискається кнопка «Sort by Name» (Сортувати за ім’ям) — список сортується за зростанням за ім’ям.
//     Коли натискається кнопка «Sort by Value» (Сортувати за значенням) — список сортується за зростанням за значенням.
//     Коли натискається кнопка «Delete» (Видалити) — усі вибрані елементи у списку видаляються.
//     Загальна інформація
//     Вносьте будь-які зміни чи доповнення, які, на вашу думку, покращать зручність використання додатка. Код має бути чистим, добре організованим та добре прокоментованим. Якість додатка повинна відповідати рівню, який ви б створили для платного клієнта чи роботодавця.